
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.hmc_admin_ui_s2s_secret
* Replace
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.hmc_admin_ui_s2s_secret will be created
  + resource "azurerm_key_vault_secret" "hmc_admin_ui_s2s_secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.KeyVault/vaults/hmc-prod"
      + name                    = "hmc-admin-ui-s2s-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] must be replaced
-/+ resource "azurerm_monitor_activity_log_alert" "main" {
      ~ id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - hmc-prod" -> (known after apply)
      ~ name                = "Application Insights daily cap reached - hmc-prod" -> "Application-Insights-daily-cap-reached-hmc-prod" # forces replacement
        tags                = {
            "application"         = "core-case-data"
            "builtFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "production"
            "managedBy"           = "CDM"
        }
        # (5 unchanged attributes hidden)

      ~ criteria {
          - levels             = [] -> null
          - resource_groups    = [] -> null
          - resource_ids       = [] -> null
          - resource_providers = [] -> null
          - resource_types     = [] -> null
          - statuses           = [] -> null
          - sub_statuses       = [] -> null
            # (4 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":43,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->